{
  "resourceType": "CodeSystem",
  "id": "namaste-aryuveda-codes",
  "url": "https://namaste.ayush.gov.in/ayurveda",
  "version": "1.0.0",
  "name": "NAMASTE",
  "title": "National Ayurveda Morbidity Codes (NAMASTE)",
  "status": "active",
  "experimental": false,
  "date": "2025-09-13T00:29:07.035427",
  "publisher": "Ministry of Ayush, Government of India",
  "description": "This code system defines the National Ayurveda Morbidity Codes (NAMASTE) for documenting clinical conditions in Ayurveda",
  "caseSensitive": true,
  "content": "complete",
  "concept": [
    {
      "code": "AYU",
      "display": "vyAdhi-viniScayaH",
      "definition": "nan"
    },
    {
      "code": "SQ00 (AAB-1)",
      "display": "atipralApaH (kEvalavAta)",
      "definition": "It is characterised by irrelevant and irrational talk mental confusion. This may be explained by: (a) Vitiation of Vata affecting motor and intellectual faculties."
    },
    {
      "code": "SP97 (AAB-26)",
      "display": "klamaH (kEvalavAta)",
      "definition": "It is characterised by feeling extreme exhaustion even without any physical effort work. This may be explained by: (a) Vitiation of all the three dosha seven elementary tissues and ojas."
    },
    {
      "code": "SK20(AAC-4)",
      "display": "arditaH",
      "definition": "It is characterised by deviation of one side of the face difficulty in speech loss of wrinkling non closure of eyes and lips and dribbling of saliva from the angles of mouth This may be explained by: (a) increased vatadosha affecting one half of the face."
    },
    {
      "code": "SR16(ABA-1)",
      "display": "pittasa~jcayaH",
      "definition": "It is characterized by yellowish discoloration of body and mild raised body temperature. This may be explained by accumulation of pittadosha at the designated site."
    },
    {
      "code": "SM10(ABB-9)",
      "display": "AsyavipAkaH (kEvalapitta)",
      "definition": "It is characterised by ulcer in the mouth tongue and spread towards oesophagus and stomach. This may be explained by: (a) Increased pittadosha affecting the mouth."
    },
    {
      "code": "SP96(ACB-3)",
      "display": "Alasyam (kEvala-kapha)",
      "definition": "It is characterised by unwillngness to take be physically active and avoiding engaging in mentally active activities. This may be explained by: (a) Excess kapha obstruting the mental faculties and pitta for intellect."
    },
    {
      "code": "SP5B (BI)",
      "display": "rAjayakShmA",
      "definition": "It is characterised by continuous low grade fever for a prolonged period of time along with dry skin sunken cheeks and eyes anorexia gradual loss of strength. This may be explained by: (a) Vitiation of all three dosha (predominantly kapha) leading to obstruction of channels gradually depleting all the seven tissues."
    },
    {
      "code": "SM3B(EB-3)",
      "display": "ajIrNam",
      "definition": "It is characterised by difficulty to digest food and may be associated with stomach pain bloating belching and hiccup. his may be explained by: (a) Vitiation of digestion by kapha pitta or vata."
    },
    {
      "code": "EC-1.1",
      "display": "navajvaraH",
      "definition": "the disorder is characterized by burning sensation loss of appetite nausea bodyache headache and increased body temperature. This indicates the initial stage of fever."
    },
    {
      "code": "SM53 (EE-3)",
      "display": "arSaH",
      "definition": "It is characterised by swollen and inflamed veins in the rectum and anus may be associated with itching pain discomfort and bleeding. This may be explained by: (a) Decreased digestive and metabolic factors vitation of vata kapha pitta affecting muscle fat tissue."
    },
    {
      "code": "SP71 (EE-4)",
      "display": "granthiH",
      "definition": "It is characterised by movable swelling with varying size from gram seed to watermelon. May be of different characters and constitutional symptoms. This may be explained by: (a) Involvement of all the three vitiated humours seven elementary tissues."
    },
    {
      "code": "SP19 (F-1)",
      "display": "SiraHSUlaH",
      "definition": "It is characterised by mild to severe unilateral or bilateral pain in the head that may be associated with vomiting nausea and sensitivity to light and sound. This may be explained by: (a) Vitiated vata affecting the head region."
    },
    {
      "code": "G-1",
      "display": "koThaH",
      "definition": "the disorder is characterized by skin discolouration irregular shape patches burning sensation itching and may be associated with fever. This is explained by vitiation of all three doshas affecting skin and blood."
    },
    {
      "code": "SP29 (H-1)",
      "display": "kAmaLA",
      "definition": "It is characterised by yellowish discolouration of conjunctiva skin and mucus membrane. This may be explained by: (a) Vitiation of pitta and kapha affecting liver functions."
    },
    {
      "code": "H-2.25",
      "display": "halImakaH",
      "definition": "the disorder is characterized by yellowish discoloration of eyes skin sclera and nails along with general weakness and loss of appetite."
    },
    {
      "code": "K-3",
      "display": "vAtajavraNaH",
      "definition": "the disorder is characterized by severe pain blackish discoloration dry rough base scanty thin discharge and delayed healing. This is due to predominant vitiation of vata dosha."
    }
  ]
}